# Используем официальный образ Go для сборки приложения
FROM golang:1.21.1 AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем модульные файлы и скачиваем зависимости
COPY go.mod go.sum ./
RUN go mod download

# Копируем остальные исходные файлы приложения
COPY . .

# Сборка приложения
RUN make build

# Используем минимальный образ для финального контейнера
FROM alpine:latest

# Устанавливаем необходимые зависимости
RUN apk --no-cache add ca-certificates

# Копируем скомпилированное приложение из образа сборки
COPY --from=builder /app/build/main /main

# Открываем порт, который использует приложение (укажите правильный порт)
EXPOSE 8000

# Устанавливаем команду для запуска приложения
CMD ["/main"]